app/views/comments/_form.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 5
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 9
---
  <div class="container">
    <% unless @post.comments.empty? %>
      <% @post.comments.each do |comment| %>