app/views/posts/index.html.erb

          <% if can? :manage, post%><td align="center"><%= link_to 'Destroy', post, method: :delete, data: { confirm: 'Are you sure?' } %></td><%end%>
          <%if can? :create, Comment%><td align="center"><%= link_to "Comment #{post.comments.empty? ? '' : post.comments.size}", new_post_comment_path(post) %></td><%end%>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` IN (5, 6, 9)