app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 9
---
  def index
    @comments = @post.comments.all

INSERT INTO `comments` (`user_id`, `post_id`, `comment_text`, `created_at`, `updated_at`) VALUES (2, 5, 'sfsfsdsf', '2019-02-12 13:19:10', '2019-02-12 13:19:10')
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
---
    def set_post
      @post = Post.find(params[:post_id])