app/controllers/posts_controller.rb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` IN (5, 6)
SELECT `posts`.* FROM `posts`
---
  def index
    if can? :read, Post
      @posts = Post.all.includes(:comments)

INSERT INTO `posts` (`title`, `url`, `content`, `user_id`, `created_at`, `updated_at`) VALUES ('dfsdfsfsfsfs', '', 'sfsdfsdf', 2, '2019-02-12 13:53:43', '2019-02-12 13:53:43')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE `posts` SET `content` = 'sdfsdfsdf sdfsdfsdf', `updated_at` = '2019-02-12 13:54:12' WHERE `posts`.`id` = 9
---
  def update
    respond_to do |format|
      if @post.update(post_params)